In [1]:
import pandas as pd

In [2]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2, 3, 6, 4]
df = pd.DataFrame(data={'course_name': course_name, 'duration': duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [8]:
df[1:2]

        course_name  duration
1  Machine Learning         3

In [27]:
df.iloc[[1, 2, 3], [0]]

        course_name
1  Machine Learning
2          Big Data
3     Data Engineer

In [46]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4